fonecmid-diplom/src/Enums/ВКМ_ТипыПериодаОтображения/ВКМ_ТипыПериодаОтображения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_ТипыПериодаОтображения</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВКМ_СтатусыЗадач/ВКМ_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СтатусыЗадач</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Отложено</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Enums/ВКМ_ПриоритетыЗадач/ВКМ_ПриоритетыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_ПриоритетыЗадач</name>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/BKM_ОбслуживаниеКлиентов/BKM_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>InformationRegister.ВКМ_ЗаписиЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПовтор</name>
    <comment>Для расписания</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеРасписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ВКМ_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаПовторов</name>
    <attributes>
      <name>ДатаПовтора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удаленный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияЗамещения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonForms/ВКМ_Планировщик/Module.bsl
#Область ГлобальныеПеременныеМодуляФормы

&НаКлиенте
Перем НачалоМесяца, КонецМесяца;

#КонецОбласти

///////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийПользователь = ПолучитьСсылкуНаТекущегоПользователя();
	Пользователи.Добавить(ТекущийПользователь);
	Календарь = ТекущаяДата();
	ВремяНачалаРабочегоДня = ВКМ_ОбщийСерверныйМодуль.ПолучитьВремяНачалаРабочегоДня();
	// Тип периода по умолчанию - День
	ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.День");
	// Настройка и заполнение планировщика
	УстановкаТекущегоПериодаОтображения(Календарь);
	НастройкаСвойствПланировщика();
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Обновить время начала рабочего дня" Тогда
		// Производим настройку отображения 
		ВремяНачалаРабочегоДня = ВКМ_ОбщийСерверныйМодуль.ПолучитьВремяНачалаРабочегоДня();	
		НастройкаСвойствПланировщика();
		//Заполняем заново
	ИначеЕсли ИмяСобытия = "Обновить данные планировщика" Тогда
		ЗаполнитьПланировщикНаСервере();	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

///////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПериодаОтображенияПриИзменении(Элемент)
	НастройкаСвойствПланировщика(); 
	// Величина в секундах
	Разница = Планировщик.ТекущиеПериодыОтображения[0].Конец - Планировщик.ТекущиеПериодыОтображения[0].Начало;
	// Переключаемся с месяца
	Если Разница > 86400 * 7 Тогда 
		// Нынешний месяц (получаем глобально)
		Если ТекущаяДата() >= НачалоМесяца И ТекущаяДата() <= КонецМесяца Тогда 
			// Текущий день или неделя
			УстановкаТекущегоПериодаОтображения(ТекущаяДата());
		Иначе 
			// Первый день или неделя месяца
			УстановкаТекущегоПериодаОтображения(НачалоМесяца);
		КонецЕсли;
		// Переключаемся с недели
	ИначеЕсли Разница > 86400 Тогда
		Если 
			// Нынешний месяц
			ТекущаяДата() >= Планировщик.ТекущиеПериодыОтображения[0].Начало И 
			ТекущаяДата() <= Планировщик.ТекущиеПериодыОтображения[0].Конец Тогда
			УстановкаТекущегоПериодаОтображения(ТекущаяДата());
		Иначе 
			// Первый день нашей недели или неделя в месяце
			УстановкаТекущегоПериодаОтображения(Планировщик.ТекущиеПериодыОтображения[0].Начало);		
		КонецЕсли;  
	Иначе 
		//Неделя или месяц с нашим днем
		УстановкаТекущегоПериодаОтображения(Планировщик.ТекущиеПериодыОтображения[0].Начало);	
	КонецЕсли;  
	
	// Не день - отключаем отображение задач по всем пользователям
	Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.День") Тогда
		Элементы.ОтображатьЗадачиНесколькихПользователей.Видимость = Истина;
	Иначе
		Элементы.ОтображатьЗадачиНесколькихПользователей.Видимость = Ложь;
		// Снимаем галочку
		ОтображатьЗадачиНесколькихПользователей = Ложь;
	КонецЕсли;
	// Очищаем список
	ОтображатьЗадачиНесколькихПользователейПриИзменении(Элементы.ОтображатьЗадачиНесколькихПользователей);	
КонецПроцедуры 

&НаКлиенте
Процедура ФильтрыПриИзменении(Элемент)
	ЗаполнитьПланировщикНаСервере();
	
	Если
		Статусы.Количество() = 0 И
		Приоритеты.Количество() = 0 И
		Категории.Количество() = 0
	Тогда
		Элементы.ГруппаФильтры.Заголовок = "Фильтры";
	Иначе
		Элементы.ГруппаФильтры.Заголовок = "Фильтры (установлены)";
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОтображатьЗадачиНесколькихПользователейПриИзменении(Элемент)
	Если ОтображатьЗадачиНесколькихПользователей Тогда
		Элементы.Пользователи.Видимость = Истина;
	Иначе
		Элементы.Пользователи.Видимость = Ложь;
		Пользователи.Очистить();
		Пользователи.Добавить(ТекущийПользователь);
	КонецЕсли;
	ЗаполнитьПланировщикНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Пользователи) Тогда
		Пользователи.Добавить(ТекущийПользователь);
	КонецЕсли;
	ЗаполнитьПланировщикНаСервере();
КонецПроцедуры

#Область ОбработчикиСобытийКомандФормы 

// Обработчик команды по смене на отображаемый период с текущей датой
&НаКлиенте
Процедура Сегодня(Команда)
	УстановкаТекущегоПериодаОтображения(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ЗаполнитьПланировщикНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	УстановкаТекущегоПериодаОтображения(Календарь);
	Элементы.ГруппаВыборДаты.Скрыть();
КонецПроцедуры

#КонецОбласти   

#КонецОбласти

///////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийПоляПланировщика 

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	// Берем время начала для дня и недели 
	ДатаОтображения = ТекущиеПериодыОтображения[0].Начало; 
	// Для месяца меняем значение
	Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Месяц") Тогда
		ДатаОтображения = ?(Планировщик.ТекущиеПериодыОтображения[0].ВремяНачалаПлан > ТекущиеПериодыОтображения[0].Начало,
		ДобавитьМесяц(НачалоМесяца, -1), ДобавитьМесяц(НачалоМесяца, 1));
	КонецЕсли;
	// Актуализируем данные
	УстановкаТекущегоПериодаОтображения(ДатаОтображения);
КонецПроцедуры
// Обработчик одинарного клика по полю планировщика
&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Обработчик двойного клика по полю планировщика
&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Переопределяем на открытие привязанного по ссылке документа
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	ОткрытьФорму("Документ.BKM_ОбслуживаниеКлиентов.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры 

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ) 
	
	Для каждого УдаляемыйЭлемент Из Элемент.ВыделенныеЭлементы Цикл
		Если 
			ОтображатьЗадачиНесколькихПользователей И 
			УдаляемыйЭлемент.ЗначенияИзмерений["Пользователь"] <> ТекущийПользователь
		Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;

	СоответствиеДокументовСИзменяемымиДанными = СформироватьСоответствияДокументов(Элемент.ВыделенныеЭлементы, Истина);	
	ИзменениеДокументовНаСервере(СоответствиеДокументовСИзменяемымиДанными, Отказ);
	Если Отказ Тогда
		ПредупреждениеАсинх("Данные не были удалены.", 10, "Невозможность удаления данных");
	КонецЕсли;
	Оповестить("Изменить данные");
КонецПроцедуры 

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ОтображатьЗадачиНесколькихПользователей И ЗначенияИзмерений["Специалист"] <> ТекущийПользователь Тогда
		Возврат;
	КонецЕсли;
	ОткрытиеФормыСоздаваемогоДокумента(Начало, Конец);	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНажатиеНаЭлементеШкалыВремени(Элемент, ЭлементШкалыВремени, Дата)
	// Месяц
	Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Месяц") Тогда 
		// Берем время начала из общих настроек
		Начало = НачалоДня(Дата) + (ВремяНачалаРабочегоДня - Дата(1,1,1));
		Конец = КонецДня(Дата);
	Иначе
		Начало = НачалоЧаса(Дата);
		Конец = Начало + 3600;
	КонецЕсли;
	ОткрытиеФормыСоздаваемогоДокумента(Начало, Конец);
КонецПроцедуры

// Процедура, срабатывающая при попытке перетаскивания элемента планировщика (ссылка на запись в документе)
&НаКлиенте
Процедура ПланировщикПроверкаПеретаскиванияВнутри(Элемент, ПараметрыПеретаскивания, ВариантИзмененияГраниц, ДействиеПеретаскивания, Отказ)
	// Существующий элемент или новый (копируем)
	Если ДействиеПеретаскивания <> ДействиеПеретаскиванияВнутриПланировщика.Выделение Тогда
		// Тип периода - месяц
		Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Месяц") Тогда  
			// Если меняется начало и конец (границы) элементов планировщика 
			Если ВариантИзмененияГраниц = ВариантИзмененияГраницПеретаскиванияВнутриПланировщика.НачалоИКонец Тогда  
				// У каждого сохраняемого элемента сохраняем времена начала и окончания, меняем только даты
				Для каждого Параметр Из ПараметрыПеретаскивания Цикл
					Параметр.ВремяНачалаПлан = Параметр.ВремяНачалаПлан + (Параметр.Элемент.ВремяНачалаПлан - НачалоДня(Параметр.Элемент.ВремяНачалаПлан));
					Параметр.Конец = Параметр.ВремяНачалаПлан + (Параметр.Элемент.Конец - Параметр.Элемент.ВремяНачалаПлан);
				КонецЦикла;
				// Отказываемся от перетаскивания
			Иначе
				Отказ = Истина;
			КонецЕсли;
			//День или неделя	
		Иначе 
			Для каждого Параметр Из ПараметрыПеретаскивания Цикл
					 // Не один и тот же день или разница между временем начала/конца и началом дня меньше указанного 
					СтруктураВремен = ПолучитьВременаНачалаОкончания(Параметр.Начало, Параметр.Конец);
				Если  
					НачалоДня(Параметр.ВремяНачалаПлан) <> НачалоДня(Параметр.Конец) ИЛИ
					СтруктураВремен.ВремяНачалаПлан < ВремяНачалаРабочегоДня ИЛИ
					СтруктураВремен.Конец < ВремяНачалаРабочегоДня ИЛИ
					(ОтображатьЗадачиНесколькихПользователей И
					 Параметр.ЗначенияИзмерений["Пользователь"] <> ТекущийПользователь)
				Тогда
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	Для каждого ВыделенныйЭлемент Из Элемент.ВыделенныеЭлементы Цикл
		Если ВыделенныйЭлемент.ВремяНачалаПлан = Дата(1970,1,1) ИЛИ ВыделенныйЭлемент.Конец = Дата(1970,1,1) Тогда
			ОтменаРедактирования = Истина;
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	// Новые документы
	Если НовыйЭлемент Тогда
		МассивСтруктурДанныхНовыхДокументов = Новый Массив;
		Для каждого ВыделенныйЭлемент Из Элемент.ВыделенныеЭлементы Цикл
			СтруктураДанных = Новый Структура("ВремяНачалаПлан, Конец, СсылкаНаДокумент",
			ВыделенныйЭлемент.ВремяНачалаПлан,
			ВыделенныйЭлемент.Конец,
			ВыделенныйЭлемент.Значение);
			МассивСтруктурДанныхНовыхДокументов.Добавить(СтруктураДанных);
		КонецЦикла;
		
		МассивСсылок = СозданиеДокументовКопированиемНаСервере(МассивСтруктурДанныхНовыхДокументов);
		Для Индекс = 0 По МассивСсылок.ВГраница() Цикл
			Элемент.ВыделенныеЭлементы[Индекс].Значение = МассивСсылок[Индекс];
		КонецЦикла;
		// Существующие документы		
	Иначе
		СоответствиеДокументовСИзменяемымиДанными = СформироватьСоответствияДокументов(Элемент.ВыделенныеЭлементы, Ложь);
		ИзменениеДокументовНаСервере(СоответствиеДокументовСИзменяемымиДанными, ОтменаРедактирования);
	КонецЕсли;
	Оповестить("Изменить данные");
КонецПроцедуры 

&НаКлиенте
Процедура ПланировщикОбработкаФормированияКоманд(Элемент, ПараметрыКоманд, Команды, КомандаПоУмолчанию)
	// Нажимаем по элементу планировщика
	Если ПараметрыКоманд.Источник = ИсточникКомандПланировщика.Элементы Тогда 
		 	//Если ОтображатьЗадачиНесколькихПользователей И ПараметрыКоманд.Элементы[0].ЗначенияИзмерений["Пользователь"] <> ТекущийПользователь

		Если ОтображатьЗадачиНесколькихПользователей И ПараметрыКоманд.Элементы[0].ЗначенияИзмерений["Специалист"] <> ТекущийПользователь
		И ТекущийПользователь <> ЭтоАдминистратор() Тогда
			Команды.Очистить();
			КомандаПоУмолчанию = Неопределено;
			Возврат;
		КонецЕсли;
		
		// Ссылка на документ
		ДокументСсылка = ПараметрыКоманд.Элементы[0].Значение;
		// Описываем команду контекстного меню
		Разделитель = Новый ОписаниеКомандыПоляПланировщика(Неопределено);
		
		Команды.Добавить(Разделитель); 
		
		#Область СозданиеПодменюСКомандамиПоИзменениюСтатуса
		СтатусВыполнено = Новый ОписаниеОповещения("СменаСтатусаВыполнено", ЭтотОбъект, ДокументСсылка);
		СтатусЗапланировано = Новый ОписаниеОповещения("СменаСтатусаЗапланировано", ЭтотОбъект, ДокументСсылка);
		СтатусОтложено = Новый ОписаниеОповещения("СменаСтатусаОтложено", ЭтотОбъект, ДокументСсылка);
		
		КомандаВыполнено = Новый ОписаниеКомандыПоляПланировщика(СтатусВыполнено, "Выполнено");
		КомандаВыполнено.Картинка = БиблиотекаКартинок.ЗаписатьИЗакрыть;
		
		КомандаЗапланировано = Новый ОписаниеКомандыПоляПланировщика(СтатусЗапланировано, "Запланировано");
		КомандаЗапланировано.Картинка = БиблиотекаКартинок.СтартБизнесПроцесса;
		КомандаОтложено = Новый ОписаниеКомандыПоляПланировщика(СтатусОтложено, "Отложено");
		КомандаОтложено.Картинка = БиблиотекаКартинок.Календарь;
		
		СтатусПодменю = Новый Массив;
		СтатусПодменю.Добавить(КомандаВыполнено);
		СтатусПодменю.Добавить(КомандаЗапланировано);
		СтатусПодменю.Добавить(КомандаОтложено);
		
		КомандаСтатус = Новый ОписаниеКомандыПоляПланировщика(СтатусПодменю, "Установить статус");
		КомандаСтатус.Картинка = БиблиотекаКартинок.Задача;
		
		Команды.Добавить(КомандаСтатус);
		#КонецОбласти 
		
		#Область СозданиеПодменюСКомандамиПоИзменениюПриоритета
		ПриоритетВысокий = Новый ОписаниеОповещения("СменаПриоритетаВысокий", ЭтотОбъект, ДокументСсылка);
		ПриоритетСредний = Новый ОписаниеОповещения("СменаПриоритетаСредний", ЭтотОбъект, ДокументСсылка);
		ПриоритетНизкий = Новый ОписаниеОповещения("СменаПриоритетаНизкий", ЭтотОбъект, ДокументСсылка);
		
		КомандаВысокий = Новый ОписаниеКомандыПоляПланировщика(ПриоритетВысокий, "Высокий");
		КомандаВысокий.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
		КомандаСредний = Новый ОписаниеКомандыПоляПланировщика(ПриоритетСредний, "Средний");
		КомандаСредний.Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
		КомандаНизкий = Новый ОписаниеКомандыПоляПланировщика(ПриоритетНизкий, "Низкий");
		КомандаНизкий.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
		
		ПриоритетПодменю = Новый Массив;
		ПриоритетПодменю.Добавить(КомандаВысокий);
		ПриоритетПодменю.Добавить(КомандаСредний);
		ПриоритетПодменю.Добавить(КомандаНизкий);
		
		КомандаПриоритет = Новый ОписаниеКомандыПоляПланировщика(ПриоритетПодменю, "Установить приоритет");
		КомандаПриоритет.Картинка = БиблиотекаКартинок.ОформлениеКругЧерный;
		
		Команды.Добавить(КомандаПриоритет);	
		#КонецОбласти
		
		#Область ИзменениеЦветаЗадачи
		Команды.Добавить(Разделитель);
		ОписаниеСменыЦвета = Новый ОписаниеОповещения("СменаЦветаКатегории", ЭтотОбъект, ДокументСсылка);
		КомандаСменыЦвета = Новый ОписаниеКомандыПоляПланировщика(ОписаниеСменыЦвета, "Сменить цвет");
		КомандаСменыЦвета.Картинка = БиблиотекаКартинок.ОформлениеЗвездаЗаполненная;
		Команды.Добавить(КомандаСменыЦвета);
		#КонецОбласти
		
	ИначеЕсли ПараметрыКоманд.Источник = ИсточникКомандПланировщика.ПустаяОбластьЭлементов Тогда
		Если 
			ОтображатьЗадачиНесколькихПользователей И
			ПараметрыКоманд.ЗначенияИзмерений["Специалист"] <> ТекущийПользователь
			Тогда
			Команды.Очистить();
			КомандаПоУмолчанию = Неопределено;
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры 

//////////////////////////  

 &НаСервере
Функция ЭтоАдминистратор()
	Возврат Справочники.Пользователи.НайтиПоНаименованию("Администратор");
КонецФункции

&НаКлиенте
Процедура ПланировщикНажатиеНаДействиеПланировщика(Элемент, ЭлементПланировщика, Действие)
    Если Действие.Значение = "ИзменитьЦвет" Тогда
		СменаЦветаКатегории(ЭлементПланировщика.Значение);
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПланировщикНажатиеНаЭлементеИзмерения(Элемент, ЭлементИзмерения, ЗначенияИзмерений, СтандартнаяОбработка)
    СтандартнаяОбработка = ОткрытиеКарточкиПользователя();
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()
	
	Планировщик.Элементы.Очистить();
	СозданиеИзмерений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_ОбслуживаниеКлиентов.Ссылка КАК Ссылка,
	|	BKM_ОбслуживаниеКлиентов.ВремяНачалаПлан КАК Начало,
	|	BKM_ОбслуживаниеКлиентов.ВремяОкончанияПлан КАК Окончание,
	|	BKM_ОбслуживаниеКлиентов.Категория.Представление КАК КатегорияПредставление,
	|	BKM_ОбслуживаниеКлиентов.Категория.Цвет КАК КатегорияЦвет,
	|	BKM_ОбслуживаниеКлиентов.Статус КАК Статус,
	|	BKM_ОбслуживаниеКлиентов.Приоритет КАК Приоритет,
	|	BKM_ОбслуживаниеКлиентов.Комментарий КАК Комментарий,
	|	BKM_ОбслуживаниеКлиентов.Специалист КАК Пользователь,
	|	BKM_ОбслуживаниеКлиентов.ДанныеРасписания КАК ДанныеРасписания,
	|	BKM_ОбслуживаниеКлиентов.ТаблицаПовторов.(
	|		ДатаПовтора КАК ДатаПовтора,
	|		Удаленный КАК Удаленный,
	|		ДатаЗамещения КАК ДатаЗамещения,
	|		ВремяНачалаЗамещения КАК ВремяНачалаЗамещения,
	|		ВремяОкончанияЗамещения КАК ВремяОкончанияЗамещения
	|	) КАК ТаблицаПовторов,
	|	BKM_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК Дата
	|ИЗ
	|	Документ.BKM_ОбслуживаниеКлиентов КАК BKM_ОбслуживаниеКлиентов
	|ГДЕ
	|	BKM_ОбслуживаниеКлиентов.Специалист В(&Пользователи)
	|	И BKM_ОбслуживаниеКлиентов.ПометкаУдаления = ЛОЖЬ
	|	И (BKM_ОбслуживаниеКлиентов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			ИЛИ BKM_ОбслуживаниеКлиентов.ТаблицаПовторов.ДатаПовтора МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	И (&НетКатегорий
	|			ИЛИ BKM_ОбслуживаниеКлиентов.Категория В (&СписокКатегорий))
	|	И (&НетСтатусов
	|			ИЛИ BKM_ОбслуживаниеКлиентов.Статус В (&СписокСтатусов))
	|	И (&НетПриоритетов
	|			ИЛИ BKM_ОбслуживаниеКлиентов.Приоритет В (&СписокПриоритетов))";
	
	Запрос.УстановитьПараметр("Пользователи", Пользователи);
	Запрос.УстановитьПараметр("ДатаНачала", Планировщик.ТекущиеПериодыОтображения[0].Начало);
	Запрос.УстановитьПараметр("ДатаОкончания", Планировщик.ТекущиеПериодыОтображения[0].Конец); 
	
	Запрос.УстановитьПараметр("СписокКатегорий", Категории);
	Запрос.УстановитьПараметр("СписокСтатусов", Статусы);
	Запрос.УстановитьПараметр("СписокПриоритетов", Приоритеты);
	
	Запрос.УстановитьПараметр("НетКатегорий", НЕ ЗначениеЗаполнено(Категории));
	Запрос.УстановитьПараметр("НетСтатусов", НЕ ЗначениеЗаполнено(Статусы));
	Запрос.УстановитьПараметр("НетПриоритетов", НЕ ЗначениеЗаполнено(Приоритеты));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вычисление дат начала и конца для создаваемого элемента планировщика		 
		СтруктураДат = ПолучитьДатыНачалаОкончания(Выборка.Дата, Выборка.Начало, Выборка.Окончание);		
		Элемент = Планировщик.Элементы.Добавить(СтруктураДат.ВремяНачалаПлан, СтруктураДат.Конец);
		// Создание и заполнение данными элемента планировщика
		Элемент.Текст = Выборка.КатегорияПредставление;
		Элемент.Значение = Выборка.Ссылка;
		Элемент.ЦветФона = Выборка.КатегорияЦвет.Получить();
		Элемент.Подсказка = Выборка.Комментарий;
		
		// В зависимости от статуса устанавливаем картинку в элементе планировщика
		Если Выборка.Статус = Перечисления.ВКМ_СтатусыЗадач.Выполнено Тогда
			Элемент.Картинка = БиблиотекаКартинок.ЗаписатьИЗакрыть;
		ИначеЕсли Выборка.Статус = Перечисления.ВКМ_СтатусыЗадач.Запланировано Тогда
			Элемент.Картинка = БиблиотекаКартинок.СтартБизнесПроцесса;
		ИначеЕсли Выборка.Статус = Перечисления.ВКМ_СтатусыЗадач.Отложено Тогда
			Элемент.Картинка = БиблиотекаКартинок.Календарь;
		КонецЕсли;
		
		Элемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Подчеркивание, 5);
		
		// В зависимости от приоритета устанавливаем цвет рамки в элементе планировщика
		Если Выборка.Приоритет = Перечисления.ВКМ_ПриоритетыЗадач.Высокий Тогда
			Элемент.ЦветРамки = Новый Цвет(255,0,0);
		ИначеЕсли Выборка.Приоритет = Перечисления.ВКМ_ПриоритетыЗадач.Средний Тогда
			Элемент.ЦветРамки = Новый Цвет(255,255,0);
		ИначеЕсли Выборка.Приоритет = Перечисления.ВКМ_ПриоритетыЗадач.Низкий Тогда
			Элемент.ЦветРамки = Новый Цвет(0,255,0);		
		КонецЕсли;
		
		// Если тип периода не месяц, то отображаем действие 
		Если ТипПериодаОтображения <> Перечисления.ВКМ_ТипыПериодаОтображения.Месяц И Выборка.Пользователь = ТекущийПользователь Тогда
			ДействиеЦвет = Элемент.Действия.Добавить("ИзменитьЦвет",,БиблиотекаКартинок.ОформлениеЗвездаЗаполненная);
			ДействиеЦвет.Подсказка = "Изменить цвет задачи";
			//ДействиеЦвет.Положение = ПоложениеДействияЭлементаПланировщика.ПослеТекста; (по желанию)
		КонецЕсли;
		
		// Если нужно отображать задачи пользователей, то добавляем значение измерения в элемент
		Если ОтображатьЗадачиНесколькихПользователей Тогда
			Измерения = Новый Соответствие;
			Измерения.Вставить("Специалист", Выборка.Пользователь);
			Элемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(Измерения);
			Если Выборка.Пользователь <> ТекущийПользователь Тогда
				Элемент.РежимРазрешенияРедактирования = РежимРазрешенияРедактированияЭлементаПланировщика.ЗапретитьПеретаскиваниеИРастягивание;
			КонецЕсли;
		КонецЕсли;

		// Получаем расписание из реквизита ХранилищеЗначения в документе
		Элемент.Расписание = Выборка.ДанныеРасписания.Получить(); 
		// Добавляем в расписание замещающие элементы, если они присутствуют
		ВыборкаПовторов = Выборка.ТаблицаПовторов.Выбрать();
		Пока ВыборкаПовторов.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПовторов.ДатаЗамещения) ИЛИ ВыборкаПовторов.Удаленный Тогда
				ЭлементЗамещения = Элемент.ЗамещающиеЭлементы.Добавить(ВыборкаПовторов.ДатаПовтора + (Выборка.Начало - Дата(1,1,1)));
				СтруктураДатЗамещения = ПолучитьДатыНачалаОкончания(ВыборкаПовторов.ДатаЗамещения, 
																	ВыборкаПовторов.ВремяНачалаЗамещения,
																	ВыборкаПовторов.ВремяОкончанияЗамещения);		
				ЭлементЗамещения.ВремяНачалаПлан = СтруктураДатЗамещения.ВремяНачалаПлан;
				ЭлементЗамещения.Конец = СтруктураДатЗамещения.Конец;
				ЭлементЗамещения.Удаленный = ВыборкаПовторов.Удаленный;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СозданиеИзмерений() 
	Планировщик.Измерения.Очистить();
	Если ОтображатьЗадачиНесколькихПользователей Тогда
		// Отобразим измерения (пользователей) 
		ИзмерениеПользователи = Планировщик.Измерения.Добавить("Специалист");
		Для каждого ЭлементСписка Из Пользователи Цикл
			ЭлементИзмерения = ИзмерениеПользователи.Элементы.Добавить(ЭлементСписка.Значение, ЭлементСписка.Значение.Наименование);
			Если ЭлементИзмерения.Значение <> ТекущийПользователь Тогда
				// сине-белый другие
				ЭлементИзмерения.ЦветФона = Новый Цвет(80, 0, 145);
				ЭлементИзмерения.ЦветТекста = Новый Цвет(255, 255, 255);
			Иначе
				ЭлементИзмерения.ЦветТекста = Новый Цвет(0,0,0);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура НастройкаСвойствПланировщика()
	// Месяц
	Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Месяц") Тогда
		// Дни будут сверху
		Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
		
		// Отключаем видимость второй шкалы времени
		ШкалаМинуты = Планировщик.ШкалаВремени.Элементы[1];
		ШкалаМинуты.Видимость = Ложь;
		
		// Настройка единственной видимой шкалы времени
		Шкала = Планировщик.ШкалаВремени.Элементы[0];	
		Шкала.Единица = ТипЕдиницыШкалыВремени.День;
		Шкала.Кратность = 1;
		// День недели и дата
		Шкала.Формат = "ДФ='ддд, дд МММ гггг'";
		// Выделение цветами заголовков дней
		Шкала.ЦветФона = WebЦвета.ГрифельноСерый; 
		Шкала.ЦветЛиний = WebЦвета.Черный;
		Шкала.ЦветТекста = WebЦвета.Белый;
		
		// Переносим шкалу через каждые 7 дней
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
		Планировщик.КратностьПериодическогоВарианта = 7;
		// Не пропускаем дни
		Планировщик.ОтступСНачалаПереносаШкалыВремени = 0;
		Планировщик.ОтступСКонцаПереносаШкалыВремени = 0;
		// Отображение времени начала и конца 
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачалаИКонца;
		// Отключаем встроенные заголовки
		Планировщик.ОтображатьПеренесенныеЗаголовки = Ложь;
		
	Иначе 
		//Время слева
		Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево; 
		
		// Включаем видимость второй шкалы времени для создания элементов, кратных 5 минутам
		ШкалаМинуты = Планировщик.ШкалаВремени.Элементы[1];
		ШкалаМинуты.Видимость = Истина;  
		
		// Настройка единственной видимой шкалы времени
		Шкала = Планировщик.ШкалаВремени.Элементы[0];
		Шкала.Единица = ТипЕдиницыШкалыВремени.Час;
		Шкала.Кратность = 1;
		// Формата "Часы:Минуты"
		Шкала.Формат = "ДФ='ЧЧ:мм'";
		// Цвета шкал времени ставим по умолчанию
		Шкала.ЦветФона = Новый Цвет(); 
		Шкала.ЦветЛиний = Новый Цвет();
		Шкала.ЦветТекста = Новый Цвет();
		
		// Перенос шкалы каждые 24 часа 
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
		Планировщик.КратностьПериодическогоВарианта = 24; 
		// пропускаем первые N часов
		Планировщик.ОтступСНачалаПереносаШкалыВремени = Час(ВремяНачалаРабочегоДня);
		Планировщик.ОтступСКонцаПереносаШкалыВремени = 0;
		// Отображение времени начала 
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачала;	
		// Включаем встроенные заголовки
		Планировщик.ОтображатьПеренесенныеЗаголовки = Истина;	
		
	КонецЕсли;
КонецПроцедуры

// Выделяем дни, не относящиеся к месяцу 
&НаКлиенте
Процедура НастройкаИнтерваловФона()
	// Очищаем коллекцию интервалов
	Планировщик.ИнтервалыФона.Очистить();  
	
	// Вычисляем начало и конец отображаемого периода
	НачалоПериода = Планировщик.ТекущиеПериодыОтображения[0].Начало;
	КонецПериода = Планировщик.ТекущиеПериодыОтображения[0].Конец;
	
	// Если тип периода не месяц, то интервалы фона не создаем
	Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Месяц") Тогда
		// Выделение цветом ячеек перед текущим месяцем, если такие ячейки есть
		Если НачалоМесяца > НачалоПериода Тогда
			ИнтервалФона = Планировщик.ИнтервалыФона.Добавить(НачалоПериода, НачалоМесяца - 1);
			ИнтервалФона.Цвет = WebЦвета.ГрифельноСерый;
		КонецЕсли;
		// Выделение цветом ячеек после текущего месяца, если такие ячейки есть
		Если КонецМесяца < КонецПериода Тогда
			ИнтервалФона = Планировщик.ИнтервалыФона.Добавить(КонецМесяца + 1, КонецПериода);
			ИнтервалФона.Цвет = WebЦвета.ГрифельноСерый;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаТекущегоПериодаОтображения(ДатаОтображения)
	// Месяц
	Если ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Месяц") Тогда
		// Начало и конец месяца
		НачалоМесяца = НачалоМесяца(ДатаОтображения);
		КонецМесяца = КонецМесяца(ДатаОтображения);
		// Представление периода (для заголовка формы)
		ПредставлениеПериода = ПредставлениеПериода(НачалоМесяца, КонецМесяца); 
		
		// Вычисляем недели для первого и последнего дня месяца
		НачалоПериода = НачалоНедели(НачалоМесяца);
		КонецПериода = КонецНедели(КонецМесяца);
		
		// Если период отображения - неделя или день
	Иначе
		НачалоПериода = ?(ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Неделя")
		,
		НачалоНедели(ДатаОтображения), НачалоДня(ДатаОтображения));
		КонецПериода = ?(ТипПериодаОтображения = ПредопределенноеЗначение("Перечисление.ВКМ_ТипыПериодаОтображения.Неделя"),
		КонецНедели(ДатаОтображения), КонецДня(ДатаОтображения));
		ПредставлениеПериода = ПредставлениеПериода(НачалоПериода, КонецПериода);
	КонецЕсли;
	
	// Очищаем коллекцию периодов
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	// Добавляем в коллекцию новый элемент 
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	//Формируем заголовок формы на основе периода
	Заголовок = "Период: " + ПредставлениеПериода;  
	Календарь = НачалоПериода;
	НастройкаИнтерваловФона();
	// Перезаполнение данными планировщика
	ЗаполнитьПланировщикНаСервере();	
КонецПроцедуры 

&НаКлиенте
Функция СформироватьСоответствияДокументов(ВыделенныеЭлементы, Удаление)
	СоответствиеДокументовСИзменяемымиДанными = Новый Соответствие;
	Для каждого УдаляемыйЭлемент Из ВыделенныеЭлементы Цикл
		Если СоответствиеДокументовСИзменяемымиДанными.Получить(УдаляемыйЭлемент.Значение) = Неопределено Тогда
			СоответствиеДокументовСИзменяемымиДанными.Вставить(УдаляемыйЭлемент.Значение, Новый Массив);
		КонецЕсли;
		СтруктураДанных = Новый Структура("ДатаЗамещения, ВремяНачалаПлан, Конец, Удаление");
		СтруктураДанных.ДатаЗамещения = УдаляемыйЭлемент.ДатаЗамещения;
		СтруктураДанных.Начало = УдаляемыйЭлемент.ВремяНачалаПлан;
		СтруктураДанных.Конец = УдаляемыйЭлемент.Конец;
		СтруктураДанных.Удаление = Удаление;
		СоответствиеДокументовСИзменяемымиДанными[УдаляемыйЭлемент.Значение].Добавить(СтруктураДанных);
	КонецЦикла;
	Возврат СоответствиеДокументовСИзменяемымиДанными;
КонецФункции 

&НаСервереБезКонтекста
Процедура ИзменениеДокументовНаСервере(СоответствиеДокументовСИзменяемымиДанными, Отказ)
	
	Для каждого ЭлементСоответствия Из СоответствиеДокументовСИзменяемымиДанными Цикл
		// Блокировка данных от пользователя
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ЭлементСоответствия.Ключ);
		Исключение
			// Невозможность блокировки при ведущейся работе
			ТекстСообщения = СтрШаблон("С задачей ""%1"" уже взаимодействуют.", ЭлементСоответствия.Ключ);
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецПопытки;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементСоответствия Из СоответствиеДокументовСИзменяемымиДанными Цикл
		ДокументОбъект = ЭлементСоответствия.Ключ.ПолучитьОбъект();
		Для каждого СтруктураДанных Из ЭлементСоответствия.Значение Цикл
			//ДокументОбъект = Документы.Задачи.СоздатьДокумент();(подсказка)
			// Проверяем надо ли удалять документ без повторов
			Если НЕ ДокументОбъект.ЕстьПовтор Тогда	
				Если СтруктураДанных.Удаление Тогда
					ДокументОбъект.УстановитьПометкуУдаления(Истина);	
				Иначе
					ДокументОбъект.Дата = НачалоДня(СтруктураДанных.ВремяНачалаПлан);					
					СтруктураВремен = ПолучитьВременаНачалаОкончания(СтруктураДанных.ВремяНачалаПлан, СтруктураДанных.Конец);
					ДокументОбъект.ВремяНачалаПлан = СтруктураВремен.ВремяНачалаПлан;
					ДокументОбъект.ВремяОкончанияПлан = СтруктураВремен.Конец;
					ДокументОбъект.Записать();
				КонецЕсли;		
			Иначе
				// Производим поиск в таблице повторов документа по значению даты повтора
				СтрокаПовтора = ДокументОбъект.ТаблицаПовторов.Найти(НачалоДня(СтруктураДанных.ДатаЗамещения), "ДатаПовтора"); 
				// Заполняем данные
				СтрокаПовтора.ДатаЗамещения = НачалоДня(СтруктураДанных.ВремяНачалаПлан);
				СтруктураВременЗамещения = ПолучитьВременаНачалаОкончания(СтруктураДанных.ВремяНачалаПлан, СтруктураДанных.Конец);				
				СтрокаПовтора.ВремяНачалаЗамещения = СтруктураВременЗамещения.ВремяНачалаПлан;
				СтрокаПовтора.ВремяОкончанияЗамещения = СтруктураВременЗамещения.Конец;
				СтрокаПовтора.Удаленный = СтруктураДанных.Удаление;
				ДокументОбъект.Записать();
			КонецЕсли;	
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СозданиеДокументовКопированиемНаСервере(МассивСтруктурДанныхНовыхДокументов)
	МассивСсылок = Новый Массив;
	Для каждого СтруктураДанных Из МассивСтруктурДанныхНовыхДокументов Цикл
		НовыйДокумент = Документы.BKM_ОбслуживаниеКлиентов.СоздатьДокумент();
		НовыйДокумент.Дата = НачалоДня(СтруктураДанных.ВремяНачалаПлан);
		
		ВременаДокумента = ПолучитьВременаНачалаОкончания(СтруктураДанных.ВремяНачалаПлан, СтруктураДанных.Конец);
		
		НовыйДокумент.ВремяНачалаПлан = ВременаДокумента.ВремяНачалаПлан;
		НовыйДокумент.ВремяОкончанияПлан = ВременаДокумента.Конец;
		
		НовыйДокумент.Категория = СтруктураДанных.СсылкаНаДокумент.Категория;
		НовыйДокумент.Статус = СтруктураДанных.СсылкаНаДокумент.Статус;
		НовыйДокумент.Приоритет = СтруктураДанных.СсылкаНаДокумент.Приоритет;
		НовыйДокумент.Записать();
		МассивСсылок.Добавить(НовыйДокумент.Ссылка);
	КонецЦикла;
	Возврат МассивСсылок;
КонецФункции  


//&НаКлиенте
//Процедура ОткрытиеФормыСоздаваемогоДокумента(Начало, Конец)
//	// Определяем дату, время начала и окончания для передачи новому документу
//	ЭлементыЗаполнения = Новый Структура("ДатаПроведенияРабот, ВремяНачалаПлан, ВремяОкончанияПлан");
//	ЭлементыЗаполнения.ДатаПроведенияРабот = НачалоДня(Начало);
//	
//	СтруктураВремен = ПолучитьВременаНачалаОкончания(Начало, Конец);
//	
//	ЭлементыЗаполнения.ВремяНачалаПлан = ?(ЗначениеЗаполнено(СтруктураВремен.ВремяНачалаПлан), 
//		СтруктураВремен.ВремяНачалаПлан, 
//		ВремяНачалаРабочегоДня);
//		
//	ЭлементыЗаполнения.ВремяОкончанияПлан = ?(ЗначениеЗаполнено(СтруктураВремен.Конец), 
//		СтруктураВремен.Конец, 
//		Дата(1,1,1, 23,59,59));
//		
//	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыЗаполнения);
//	ОткрытьФорму("Документ.BKM_ОбслуживаниеКлиентов.Форма.ФормаДокумента", ПараметрыФормы);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыСоздаваемогоДокумента(Начало, Конец)
	// Определяем дату, время начала и окончания для передачи новому документу
	ЭлементыЗаполнения = Новый Структура("ДатаПроведенияРабот, ВремяНачалаПлан, ВремяОкончанияПлан, Специалист");
	ЭлементыЗаполнения.ДатаПроведенияРабот = НачалоДня(Начало);
	ЭлементыЗаполнения.Специалист = ТекущийПользователь;
	
	СтруктураВремен = ПолучитьВременаНачалаОкончания(Начало, Конец);
	
	ЭлементыЗаполнения.ВремяНачалаПлан = ?(ЗначениеЗаполнено(СтруктураВремен.ВремяНачалаПлан), 
		СтруктураВремен.ВремяНачалаПлан, 
		ВремяНачалаРабочегоДня);
		
	ЭлементыЗаполнения.ВремяОкончанияПлан = ?(ЗначениеЗаполнено(СтруктураВремен.Конец), 
		СтруктураВремен.Конец, 
		Дата(1,1,1, 23,59,59));
		
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыЗаполнения);
	ОткрытьФорму("Документ.BKM_ОбслуживаниеКлиентов.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВременаНачалаОкончания(ДатаНачала, ДатаОкончания)
	Начало = Дата(1,1,1) + (ДатаНачала - НачалоДня(ДатаНачала));
	Конец = Дата(1,1,1) + (ДатаОкончания - НачалоДня(ДатаОкончания));
	
	Возврат Новый Структура("ВремяНачалаПлан, Конец", Начало, Конец);
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДатыНачалаОкончания(ДатаБезВремени, ДатаНачала, ДатаОкончания)
	Начало = ДатаБезВремени + (ДатаНачала - Дата(1,1,1));
	Конец = ДатаБезВремени + (ДатаОкончания - Дата(1,1,1));
	
	Возврат Новый Структура("ВремяНачалаПлан, Конец", Начало, Конец);
КонецФункции  

#Область ДляОбработкиФормированияКоман

&НаКлиенте
Процедура СменаСтатусаВыполнено(ДокументСсылка) Экспорт
	ОписаниеРеквизита = Новый Структура("ИмяРек, ЗнчРек", "Статус", ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыЗадач.Выполнено"));
	СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура СменаСтатусаЗапланировано(ДокументСсылка) Экспорт
	ОписаниеРеквизита = Новый Структура("ИмяРек, ЗнчРек", "Статус", ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыЗадач.Запланировано"));
	СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура СменаСтатусаОтложено(ДокументСсылка) Экспорт
	ОписаниеРеквизита = Новый Структура("ИмяРек, ЗнчРек", "Статус", ПредопределенноеЗначение("Перечисление.ВКМ_СтатусыЗадач.Отложено"));
	СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура СменаПриоритетаВысокий(ДокументСсылка) Экспорт
	ОписаниеРеквизита = Новый Структура("ИмяРек, ЗнчРек", "Приоритет", ПредопределенноеЗначение("Перечисление.ВКМ_ПриоритетыЗадач.Высокий"));
	СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура СменаПриоритетаСредний(ДокументСсылка) Экспорт
	ОписаниеРеквизита = Новый Структура("ИмяРек, ЗнчРек", "Приоритет", ПредопределенноеЗначение("Перечисление.ВКМ_ПриоритетыЗадач.Средний"));
	СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита);
КонецПроцедуры

&НаКлиенте
Процедура СменаПриоритетаНизкий(ДокументСсылка) Экспорт
	ОписаниеРеквизита = Новый Структура("ИмяРек, ЗнчРек", "Приоритет", ПредопределенноеЗначение("Перечисление.ВКМ_ПриоритетыЗадач.Низкий"));
	СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита);
КонецПроцедуры 

&НаСервере
Процедура СменаСтатусаПриоритета(ДокументСсылка, ОписаниеРеквизита)
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	
	ДокументОбъект[ОписаниеРеквизита.ИмяРек] = ОписаниеРеквизита.ЗнчРек;
	ДокументОбъект.Записать();
	
	ЗаполнитьПланировщикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СменаЦветаКатегории(ДокументСсылка) Экспорт
	ОписаниеЦвета = Новый ОписаниеОповещения("ОбработатьВыборЦвета", ЭтотОбъект, ДокументСсылка);
	ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
	ДиалогВыбораЦвета.Показать(ОписаниеЦвета);
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборЦвета(Цвет, ДокументСсылка) Экспорт
	Если Цвет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект = ДокументСсылка.Категория.ПолучитьОбъект();
	СправочникОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
	СправочникОбъект.Записать();
	
	ЗаполнитьПланировщикНаСервере();
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаТекущегоПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции 

&НаСервереБезКонтекста
Функция ОткрытиеКарточкиПользователя()
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.Администратор Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции 

#КонецОбласти
